In [31]:
import pandas as pd
from sklearn.preprocessing import LabelEncoder, StandardScaler

In [49]:
df = pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

In [50]:
print(df)

     PassengerId  Survived  Pclass  \
0              1         0       3
1              2         1       1
2              3         1       3
3              4         1       1
4              5         0       3
..           ...       ...     ...
886          887         0       2
887          888         1       1
888          889         0       3
889          890         1       1
890          891         0       3

                                                  Name     Sex   Age  SibSp  \
0                              Braund, Mr. Owen Harris    male  22.0      1
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                               Heikkinen, Miss. Laina  female  26.0      0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                             Allen, Mr. William Henry    male  35.0      0
..                                                 ...     ...   ...    ...
886                              Montvila, Rev. Juozas    male  27.0      0
887                       Graham, Miss. Margaret Edith  female  19.0      0
888           Johnston, Miss. Catherine Helen "Carrie"  female   NaN      1
889                              Behr, Mr. Karl Howell    male  26.0      0
890                                Dooley, Mr. Patrick    male  32.0      0

     Parch            Ticket     Fare Cabin Embarked
0        0         A/5 21171   7.2500   NaN        S
1        0          PC 17599  71.2833   C85        C
2        0  STON/O2. 3101282   7.9250   NaN        S
3        0            113803  53.1000  C123        S
4        0            373450   8.0500   NaN        S
..     ...               ...      ...   ...      ...
886      0            211536  13.0000   NaN        S
887      0            112053  30.0000   B42        S
888      2        W./C. 6607  23.4500   NaN        S
889      0            111369  30.0000  C148        C
890      0            370376   7.7500   NaN        Q

[891 rows x 12 columns]

In [51]:
print(df.isnull().sum())
df["Age"] = df["Age"].fillna(df["Age"].mean())
#print(df)

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [18]:
df_n = df.drop("Cabin", axis=1)
print(df_n.isnull().sum())

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       2
dtype: int64

In [ ]:
print(df_n[df_n["Embarked"].isnull()])

     PassengerId  Survived  Pclass                                       Name  \
61            62         1       1                        Icard, Miss. Amelie
829          830         1       1  Stone, Mrs. George Nelson (Martha Evelyn)

        Sex   Age  SibSp  Parch  Ticket  Fare Embarked
61   female  38.0      0      0  113572  80.0      NaN
829  female  62.0      0      0  113572  80.0      NaN

In [23]:
df_n["Embarked"] = df_n["Embarked"].fillna("Z")

In [26]:
print(df_n["Embarked"].unique())

['S' 'C' 'Q' 'Z']

In [34]:
le = LabelEncoder()
df_n["Embarked"] = le.fit_transform(df_n["Embarked"])
print(df_n["Embarked"].unique())

[2 0 1 3]

In [52]:
print(df_n[["Age"]])

              Age
0   -5.924806e-01
1    6.387890e-01
2   -2.846632e-01
3    4.079260e-01
4    4.079260e-01
..            ...
886 -2.077088e-01
887 -8.233437e-01
888 -2.232906e-16
889 -2.846632e-01
890  1.770629e-01

[891 rows x 1 columns]

In [54]:
stdC = StandardScaler()
df_n["Age"] = stdC.fit_transform(df_n[["Age"]])

In [56]:
# Sorting
print(df_n[["Name", "Sex","Age"]].sort_values(by="Age"))
#print(df[["Name", "Sex","Age"]].sort_values(by="Age"))

                                     Name     Sex       Age
803       Thomas, Master. Assad Alexander    male -2.253155
755             Hamalainen, Master. Viljo    male -2.233917
644                Baclini, Miss. Eugenie  female -2.227761
469         Baclini, Miss. Helene Barbara  female -2.227761
831       Richards, Master. George Sibley    male -2.221604
..                                    ...     ...       ...
116                  Connors, Mr. Patrick    male  3.139805
96              Goldschmidt, Mr. George B    male  3.178283
493               Artagaveytia, Mr. Ramon    male  3.178283
851                   Svensson, Mr. Johan    male  3.409146
630  Barkworth, Mr. Algernon Henry Wilson    male  3.870872

[891 rows x 3 columns]